{
    "Navbar": {
        "projects": "Projectos",
        "experience": "Experiencia",
        "contact": "Contacto",
        "blog": "Blog"
    },
    "Common": {
        "showMore": "Ver m谩s",
        "showLess": "Ver menos",
        "backToProjects": "Volver a proyectos",
        "titleTecs": "Tecnologias",
        "titleRepositories": "Repositorios"
    },
    "BaseHeader": {
        "headline": "Construyendo negocios\nimpulsados por la innovaci贸n.",
        "description": "Desarrollador Full Stack con experiencia en Next.js, React y TypeScript, especializado en crear aplicaciones web atractivas, funcionales y escalables. Experto en Python, MongoDB, MySQL y Prisma para soluciones backend robustas, y en desplegar proyectos en Vercel y Google Cloud. Apasionado por transformar ideas en productos innovadores, optimizando el rendimiento y la experiencia del usuario.",
        "getInTouch": "Github",
        "downloadCV": "Descargar CV",
        "titleSkills": "Experiencia con"
    },
    "Projects": [
        {
            "id": "1",
            "name": "TripKode",
            "slug": "Ecosistema blockchain integral para econom铆as digitales descentralizadas",
            "description": "TripKode es una empresa pionera que construye ecosistemas tecnol贸gicos completos combinando desarrollo de software tradicional con blockchain propietaria (KodeChain). Creamos plataformas SaaS sectoriales interconectadas donde cada comercio puede tener su propia criptomoneda de recompensas, desde panader铆as hasta inmobiliarias tokenizadas. Utilizamos metodolog铆as Scrum descentralizadas y arquitectura triple-chain con consenso dual (DPoS + PBFT) para crear econom铆as circulares reales donde los tokens se intercambian entre sectores econ贸micos diversos.",
            "largeDescription": "TripKode redefine la intersecci贸n entre desarrollo de software empresarial y tecnolog铆a blockchain a trav茅s de KodeChain, nuestra blockchain de tercera generaci贸n con arquitectura triple-chain y consenso dual que combina Delegated Proof of Stake (DPoS) y Practical Byzantine Fault Tolerance (PBFT).\n\nNo somos solo desarrolladores web ni 煤nicamente una empresa blockchain: construimos ecosistemas tecnol贸gicos completos que transforman sectores econ贸micos enteros. Desarrollamos verticales especializados como BlockEstate para democratizar la inversi贸n inmobiliaria, sistemas de fidelizaci贸n tokenizados para panader铆as, y redes interconectadas de veterinarias, eventos y cosm茅ticos.\n\nLa magia ocurre en la interoperabilidad: los tokens ganados comprando pan pueden utilizarse para pagar alquiler en un edificio tokenizado o invertir en bienes ra铆ces, creando una econom铆a circular real donde cada sector fortalece a los dem谩s. Cada comercio opera independientemente su propio sistema de recompensas tokenizadas mientras mantiene conexi贸n con el ecosistema completo.\n\nHemos revolucionado el desarrollo de software implementando el primer sistema Scrum completamente descentralizado, operando nativamente sobre KodeChain. Nuestros procesos cr铆ticos se registran en blockchain proporcionando trazabilidad inmutable, resoluci贸n eficiente de errores y transparencia total para clientes y stakeholders.\n\nOperamos una comunidad exclusiva de desarrolladores que trabajan en un entorno completamente descentralizado, participando en una nueva forma de colaboraci贸n blockchain-native. TripKode est谩 creando el futuro donde cada comercio local puede tener su econom铆a tokenizada, los sectores se interconectan exponencialmente, y los usuarios participan en una econom铆a digital que beneficia a toda la comunidad.",
            "cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1756905969/Portafolio/banner_tripkode_portafolio_bqumll.png",
            "dark_cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1756907719/Portafolio/banner_tripkode_dark_portafolio_gtoayo.png",
            "logo": "https://res.cloudinary.com/dqluumk10/image/upload/v1729375887/TripCode/Logos/luc79qy6rewoqovhxwrz.png",
            "logo_dark": "https://res.cloudinary.com/dqluumk10/image/upload/v1729375962/TripCode/Logos/u6u9tlzjqlzxyywuzfqi.png",
            "uriDocs": "https://tripchaindocs.fly.dev/es/",
            "stack": [
                "React.js",
                "typescript",
                "Nextjs",
                "Nest.js",
                "Docker",
                "Cloudflare",
                "Go",
                "Tailwind CSS"
            ],
            "repositories": [
                {
                    "id": "2",
                    "name": "Nodo Validador",
                    "description": "Responsable de validar transacciones, generar bloques y mantener el consenso en la red. Implementa un mecanismo h铆brido de DPoS y PBFT para garantizar seguridad y velocidad en las transacciones, coordinando la verificaci贸n y comunicaci贸n entre nodos.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "",
                    "web": ""
                },
                {
                    "id": "3",
                    "name": "Nodo Completo",
                    "description": "Nodo que replica y almacena el historial completo de la blockchain, asegurando que todos los bloques y transacciones sean accesibles en cualquier momento. Act煤a como un respaldo descentralizado, permitiendo la validaci贸n independiente de datos y la ejecuci贸n de consultas avanzadas sin depender de terceros. Su implementaci贸n optimiza la indexaci贸n de datos y soporta sincronizaci贸n eficiente con otros nodos de la red.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "",
                    "web": ""
                },
                {
                    "id": "5",
                    "name": "KodeChain Descentralized Exchange",
                    "description": "Plataforma web para visualizar bloques, transacciones y la actividad de la red en tiempo real. Proporciona herramientas avanzadas de b煤squeda y an谩lisis, permitiendo auditar el historial de la blockchain, verificar el estado de cuentas y contratos inteligentes. Incluye gr谩ficos de m茅tricas de red, estados de validadores y estad铆sticas de uso, optimizando la transparencia y el monitoreo del sistema.",
                    "status": "Funcionando",
                    "isPrivate": true,
                    "uri": "",
                    "web": "https://kodechain.site"
                },
                {
                    "id": "6",
                    "name": "Web Documentation",
                    "description": "Repositorio central de documentaci贸n t茅cnica de TripChain. Contiene gu铆as detalladas sobre la configuraci贸n de nodos, interacci贸n con la API, desarrollo de smart contracts y mejores pr谩cticas de seguridad. Incluye ejemplos pr谩cticos, especificaciones de endpoints y documentaci贸n en m煤ltiples formatos para facilitar la integraci贸n con sistemas externos.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "",
                    "web": ""
                }
            ]
        },
        {
            "id": "2",
            "name": "KodeChain",
            "slug": "Red Blockchain descentralizada con criptograf铆a post-cu谩ntica y consenso h铆brido",
            "description": "Blockchain que implementa criptograf铆a post-cu谩ntica con ML-DSA-65, consenso h铆brido din谩mico (DPoS/PBFT), y arquitectura de doble capa. Elimina completamente el minado tradicional utilizando un sistema de staking moderno, procesa contratos inteligentes WASM en sandbox seguro, e integra un sistema experto nativo. Su econom铆a deflacionaria autom谩tica y red P2P avanzada con libp2p proporcionan escalabilidad, seguridad cu谩ntica-resistente y eficiencia energ茅tica superior.",
            "largeDescription": "KodeChain representa mi contribuci贸n t茅cnica m谩s significativa al espacio blockchain, desarrollando una red de tercera generaci贸n que aborda las limitaciones fundamentales de blockchains tradicionales mediante innovaciones arquitect贸nicas avanzadas.\n\nImplement茅 una arquitectura de doble capa que separa la execution chain del procesamiento de transacciones y las beacon chains para gesti贸n de consenso, permitiendo escalabilidad horizontal y flexibilidad operacional. El sistema utiliza consenso h铆brido din谩mico donde los nodos pueden alternar entre PBFT para m谩xima seguridad y finalidad, y DPoS para alto throughput, adapt谩ndose autom谩ticamente a las necesidades de la red.\n\nLa seguridad post-cu谩ntica se logra mediante la implementaci贸n completa del algoritmo Dilithium3, certificado por NIST, garantizando resistencia contra futuros ataques de computaci贸n cu谩ntica. Desarroll茅 un sistema de staking moderno que elimina completamente el minado energ茅ticamente intensivo, donde los validadores requieren stake m铆nimo de 10 TKC y m谩ximo de 100,000 TKC por validador, con per铆odo de bloqueo de 30 d铆as.\n\nLos contratos inteligentes operan en un ambiente WASM sandboxed que permite ejecuci贸n de c贸digo TypeScript/AssemblyScript de forma segura y aislada, sin acceso a recursos del sistema. Integr茅 un sistema experto nativo con motor de inferencia que eval煤a reglas configurables, procesamiento de consultas estructuradas y generaci贸n autom谩tica de respuestas.\n\nLa red P2P implementa protocolos avanzados incluyendo libp2p para descubrimiento autom谩tico, GossipSub para difusi贸n de mensajes, y DHT para tabla hash distribuida, asegurando comunicaci贸n eficiente entre nodos. El sistema econ贸mico deflacionario quema autom谩ticamente el 20% de las comisiones de transacci贸n, con distribuci贸n del 50% para validadores y 30% para desarrollo.\n\nKodeChain procesa transacciones con finalidad en segundos, consume m铆nima energ铆a comparado con blockchains tradicionales, y proporciona transparencia completa mediante registro inmutable de todas las operaciones. Esta arquitectura establece las bases para aplicaciones descentralizadas de pr贸xima generaci贸n que requieren seguridad enterprise, escalabilidad masiva y eficiencia operacional.",
            "cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1756904929/Portafolio/banner_kodechain_portafolio_sfz331.png",
            "dark_cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1756907850/Portafolio/banner_kodechain_dark_portafolio_bv5evg.png",
            "logo": "https://res.cloudinary.com/dqluumk10/image/upload/v1756827546/TripCode/Logos/ace8f488-f7d5-4215-aa71-7050eeb34573_dkblzi_eajjzn.png",
            "uriDocs": "https://tripchaindocs.fly.dev/es/",
            "stack": [
                "React.js",
                "typescript",
                "Nextjs",
                "Nest.js",
                "Docker",
                "Cloudflare",
                "Go",
                "Tailwind CSS"
            ],
            "repositories": [
                {
                    "id": "2",
                    "name": "Nodo Validador",
                    "description": "Componente fundamental en la infraestructura de la red para gestionar la integridad y continuidad operacional de la red blockchain validando los bloques en las cadenas mediante consensos.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "",
                    "web": ""
                },
                {
                    "id": "3",
                    "name": "Nodo Completo",
                    "description": "Componente en la infraestructura de la red que almacena el historial completo de las blockchains, asegurando que todos los bloques, transacciones y cadenas sean accesibles en cualquier momento.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "",
                    "web": ""
                },
                {
                    "id": "5",
                    "name": "KodeChain Explorer",
                    "description": "Plataforma web para crear cuentas(wallets), visualizar bloques, transacciones, tokens y la actividad de la red en tiempo real. Proporciona herramientas avanzadas de b煤squeda y an谩lisis, permitiendo auditar el historial de la blockchain, verificar el estado de cuentas y contratos inteligentes.",
                    "status": "Funcionando",
                    "isPrivate": true,
                    "uri": "",
                    "web": "https://kodechain.site"
                },
                {
                    "id": "6",
                    "name": "Web Documentation",
                    "description": "Repositorio central de documentaci贸n t茅cnica de KodeChain. Contiene gu铆as detalladas sobre la configuraci贸n de nodos, interacci贸n con la API, desarrollo de smart contracts y mejores pr谩cticas de seguridad.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "",
                    "web": ""
                }
            ]
        },
        {
            "id": "3",
            "name": "BlockScrum",
            "slug": "SaaS enfocado en el seguimiento de proyectos Scrum",
            "description": "Plataforma de gesti贸n 谩gil de proyectos basada en Scrum, que permite la planificaci贸n, monitoreo y optimizaci贸n de tareas en equipos de desarrollo. Incorpora tecnolog铆a blockchain para registrar eventos cr铆ticos del proyecto de manera inmutable, asegurando transparencia y trazabilidad en cada sprint, tarea y asignaci贸n de equipo.",
            "largeDescription": "Aplicaci贸n dise帽ada para la gesti贸n de proyectos bajo la metodolog铆a Scrum, proporcionando tableros interactivos para la planificaci贸n y seguimiento de sprints en tiempo real. Adem谩s de sus herramientas tradicionales de organizaci贸n de tareas y roles, BlockScrum utiliza la blockchain de TripChain para registrar eventos clave dentro del proyecto, como asignaciones de tareas, cambios en sprints y entregas finales. Esto permite que los equipos cuenten con un historial inmutable de su progreso, garantizando la transparencia y facilitando auditor铆as de cumplimiento.\n\nGracias a su arquitectura modular y escalable, BlockScrum permite la automatizaci贸n de flujos de trabajo mediante integraci贸n con APIs externas, gesti贸n de permisos basada en roles y an谩lisis de rendimiento de los equipos. Su integraci贸n con blockchain proporciona seguridad adicional en la validaci贸n de datos cr铆ticos del proyecto, asegurando que las decisiones tomadas en el desarrollo sean confiables y verificables.",
            "cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1756912400/Portafolio/banner_blockscrum_portafolio_brfipd.png",
            "dark_cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1756912557/Portafolio/banner_blockscrum_black_nhook5.png",
            "logo": "https://res.cloudinary.com/dqluumk10/image/upload/v1756915455/TripCode/Logos/blockscrum_logo_jndppi.png",
            "logo_dark": "https://res.cloudinary.com/dqluumk10/image/upload/v1756915399/TripCode/Logos/blockScrum_logo_black_bfvucu.png",
            "uriDocs": "",
            "stack": [
                "React.js",
                "typescript",
                "Nextjs",
                "MongoDB",
                "Prisma",
                "Vercel",
                "Blockchain",
                "Tailwind CSS"
            ],
            "repositories": [
                {
                    "id": "1",
                    "name": "Blockscrum-core",
                    "isPrivate": true,
                    "description": "BlockScrum es una plataforma integral para la gesti贸n 谩gil de proyectos basada en la metodolog铆a Scrum. Permite la planificaci贸n, seguimiento y control de tareas en equipos de desarrollo.",
                    "status": "En desarrollo",
                    "uri": "https://github.com/teamTripCode/tc-scrum-app",
                    "web": "https://blockscrum.vercel.app/"
                },
                {
                    "id": "2",
                    "name": "Documentaci贸n Web",
                    "isPrivate": true,
                    "description": "Repositorio destinado a la documentaci贸n oficial de BlockScrum, donde se detallan funcionalidades, gu铆as de uso y mejores pr谩cticas para optimizar la gesti贸n de proyectos 谩giles.",
                    "status": "Planeando",
                    "uri": "https://github.com/teamTripCode/tc-scrum-app",
                    "web": "https://blockscrum.vercel.app/"
                }
            ]
        },
        {
            "id": "4",
            "name": "ParfumCol",
            "slug": "DApp para el comercio de perfumes y recompensas",
            "description": "Plataforma de comercio electr贸nico especializada en perfumes, integrando tecnolog铆a blockchain para garantizar autenticidad, trazabilidad y seguridad en las transacciones. Implementa un sistema de recompensas basado en criptomonedas, permitiendo a los clientes obtener beneficios por sus compras.",
            "largeDescription": "Aplicaci贸n de comercio electr贸nico enfocada en la venta de perfumes, utilizando la blockchain de TripChain para registrar transacciones de manera inmutable y proporcionar transparencia en los procesos de compra y distribuci贸n. Su integraci贸n con smart contracts permite la emisi贸n de criptomonedas como incentivos para los clientes, generando un ecosistema de recompensas dentro de la plataforma.\nLa arquitectura de ParfumCol est谩 compuesta por un backend en Nest.js que gestiona usuarios, pedidos y transacciones sobre la blockchain, y un frontend en Next.js optimizado para velocidad y experiencia de usuario. Utiliza Prisma como ORM para manejar datos en MongoDB, Docker para despliegue escalable y Google Cloud Platform para hosting y almacenamiento seguro.",
            "cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1756915677/Portafolio/banner_parfumcol_portafolio_rtk8xf.png",
            "dark_cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1756915678/Portafolio/banner_parfumcol_black_sy9q5e.png",
            "logo": "https://res.cloudinary.com/dqluumk10/image/upload/v1756827546/TripCode/Logos/ace8f488-f7d5-4215-aa71-7050eeb34573_dkblzi_eajjzn.png",
            "uriDocs": "https://parfumcol-docs.vercel.app/",
            "stack": [
                "React.js",
                "typescript",
                "Nextjs",
                "Nest.js",
                "MongoDB",
                "Prisma",
                "Docker",
                "Google Cloud Plattform",
                "Vercel",
                "Blockchain",
                "Tailwind CSS"
            ],
            "repositories": [
                {
                    "id": "1",
                    "name": "Backend API",
                    "description": "Microservicio backend desarrollado en Nest.js con TypeScript, encargado de la autenticaci贸n de usuarios, gesti贸n de pedidos y procesamiento de pagos. Utiliza Prisma como ORM para la manipulaci贸n de datos en MongoDB e integra la blockchain de TripChain para registrar todos los procesos cr铆ticos de la aplicaci贸n. Implementa smart contracts personalizados que gestionan la criptomoneda nativa de la plataforma, permitiendo la emisi贸n y distribuci贸n de recompensas para los usuarios que realizan compras o pagan suscripciones. Expone una API RESTful segura con validaci贸n JWT, control de acceso basado en roles y protecci贸n contra ataques mediante rate limiting.",
                    "status": "Planeando",
                    "isPrivate": false,
                    "uri": "https://github.com/teamTripCode/parfumcol-backend",
                    "web": "https://parfumcol.vercel.app/"
                },
                {
                    "id": "2",
                    "name": "Frontend Web",
                    "description": "Aplicaci贸n frontend desarrollada en Next.js con TypeScript y React, optimizada para rendimiento y SEO mediante Server-Side Rendering (SSR) y Static Site Generation (SSG). Proporciona una interfaz interactiva para la compra de perfumes y la gesti贸n de recompensas en criptomonedas. Se comunica con la API backend para procesar pagos y registrar transacciones en la blockchain de TripChain. Implementa autenticaci贸n con JWT, manejo de estado con Zustand o Redux y dise帽o modular basado en componentes reutilizables.",
                    "status": "Planeando",
                    "isPrivate": false,
                    "uri": "https://github.com/teamTripCode/parfumcol-frontend",
                    "web": "https://parfumcol.vercel.app/"
                }
            ]
        },
        {
            "id": "5",
            "name": "Vexa",
            "slug": "Plataforma integral de gesti贸n empresarial y contabilidad dentro del ecosistema KodeChain",
            "description": "Sistema multi-tenant de gesti贸n empresarial que integra contabilidad, facturaci贸n, inventarios, n贸mina y reportes fiscales. Como vertical contable del ecosistema KodeChain, permite a las empresas gestionar sus operaciones mientras automatizan recompensas tokenizadas para clientes, empleados y proveedores, creando un c铆rculo virtuoso de valor dentro de la econom铆a digital.",
            "largeDescription": "Vexa es la soluci贸n integral de gesti贸n empresarial que revoluciona la administraci贸n tradicional al integrar funcionalidades contables avanzadas con la potencia del ecosistema KodeChain. La plataforma permite a empresas de cualquier tama帽o gestionar su contabilidad, facturaci贸n electr贸nica, control de inventarios, n贸mina, y reportes fiscales desde una 煤nica interfaz multi-tenant.\n\nCada empresa tenant puede configurar su propio sistema de recompensas tokenizadas, emitiendo tokens autom谩ticamente a clientes por compras recurrentes, a empleados por cumplimiento de metas, y a proveedores por entregas puntuales. Esta tokenizaci贸n empresarial se integra naturalmente con otros verticales de KodeChain, permitiendo que los tokens generados en el contexto empresarial sean utilizables en comercios, servicios y proyectos inmobiliarios del ecosistema.\n\nLa arquitectura multi-tenant garantiza que cada empresa opere en un entorno completamente aislado y personalizado, mientras mantiene acceso a las ventajas colaborativas del ecosistema KodeChain. Los tokens empresariales pueden intercambiarse con otros sectores, creando una red de valor donde las decisiones de compra, trabajo y colaboraci贸n empresarial se ven recompensadas tangiblemente.\n\nVexa incluye m贸dulos especializados para facturaci贸n electr贸nica con cumplimiento DIAN, gesti贸n de inventarios en tiempo real, c谩lculo autom谩tico de n贸minas, reportes fiscales automatizados, an谩lisis financiero predictivo, y un motor de inteligencia artificial para optimizaci贸n de flujos de caja. Todo esto potenciado por la transparencia blockchain y la interoperabilidad del ecosistema KodeChain.",
            "cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1757002050/Portafolio/banner_vexa_fvku1q.png",
            "dark_cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1757001947/Portafolio/banner_vexa_dark_ltfobn.png",
            "logo": "https://res.cloudinary.com/dqluumk10/image/upload/v1757000011/TripCode/Logos/logo-vexa_m7uewn.png",
            "logo_dark": "https://res.cloudinary.com/dqluumk10/image/upload/v1757000010/TripCode/Logos/logo_vexa_light_hyzw85.png",
            "uriDocs": "https://vexa-docs.vercel.app/",
            "stack": [
                "React.js",
                "TypeScript",
                "Next.js",
                "Nest.js",
                "MongoDB",
                "PostgreSQL",
                "Prisma",
                "Docker",
                "Google Cloud Platform",
                "Vercel",
                "KodeChain Blockchain",
                "Smart Contracts",
                "Web3.js",
                "Tailwind CSS",
                "Chart.js",
                "PDF Generation"
            ],
            "repositories": [
                {
                    "id": "1",
                    "name": "Vexa SuperApp",
                    "description": "Aplicaci贸n web multi-tenant desarrollada en Next.js para gesti贸n empresarial integral. Incluye m贸dulos de contabilidad con plan de cuentas personalizable, facturaci贸n electr贸nica DIAN, control de inventarios con c贸digos de barras, n贸mina automatizada, reportes fiscales y dashboard de tokens empresariales. Arquitectura modular que permite personalizaci贸n por tenant y integraci贸n Web3 con KodeChain.",
                    "status": "En desarrollo",
                    "isPrivate": false,
                    "uri": "https://github.com/kodechain/vexa-frontend",
                    "web": "https://vexa-platform.vercel.app/"
                },
                {
                    "id": "2",
                    "name": "Vexa Core",
                    "description": "API REST empresarial desarrollada en NestJS con arquitectura DDD y sistema multi-tenant. Gestiona contabilidad general, facturaci贸n electr贸nica, inventarios, n贸minas, reportes fiscales e integraci贸n con entidades gubernamentales. Incluye motor de smart contracts para emisi贸n de tokens empresariales, c谩lculos autom谩ticos de impuestos y sincronizaci贸n con el ecosistema KodeChain para intercambio de valor sectorial.",
                    "status": "En desarrollo",
                    "isPrivate": false,
                    "uri": "https://github.com/kodechain/vexa-backend",
                    "web": "https://vexa-api.vercel.app/"
                },
                {
                    "id": "7",
                    "name": "Vexa Documentation Hub",
                    "description": "Centro de documentaci贸n integral construido con Docusaurus. Incluye gu铆as de implementaci贸n multi-tenant, manuales de m贸dulos contables, documentaci贸n de APIs, tutoriales de integraci贸n KodeChain, casos de uso empresariales, compliance fiscal colombiano, y manuales de tokenizaci贸n empresarial. Disponible en espa帽ol con soporte para expansi贸n latinoamericana.",
                    "status": "En desarrollo",
                    "isPrivate": false,
                    "uri": "https://github.com/kodechain/vexa-docs",
                    "web": "https://vexa-docs.vercel.app/"
                }
            ]
        },
        {
            "id": "6",
            "name": "BlockEstate",
            "slug": "Plataforma de inversi贸n inmobiliaria tokenizada dentro del ecosistema KodeChain",
            "description": "Plataforma que democratiza la inversi贸n inmobiliaria a trav茅s de tokenizaci贸n, permitiendo a inversionistas acceder a proyectos desde montos peque帽os mientras recompensa a inquilinos puntuales. Opera como el vertical inmobiliario del ecosistema KodeChain, creando sinergia con m煤ltiples sectores econ贸micos a trav茅s de un sistema de recompensas y tokenizaci贸n universal.",
            "largeDescription": "BlockEstate representa la evoluci贸n natural de la inversi贸n inmobiliaria tradicional, resolviendo tres problemas fundamentales del mercado colombiano: barreras de entrada prohibitivas para inversores peque帽os, falta de incentivos para inquilinos puntuales, y desconexi贸n entre propietarios de terrenos e inversionistas.\n\nLa plataforma tokeniza proyectos inmobiliarios distribuyendo autom谩ticamente el 25% al propietario del terreno, el 60% al pool de construcci贸n, el 3% al arquitecto ganador, el 8% a un fondo de mantenimiento perpetuo y el 4% como fees de plataforma. Un algoritmo de precios escalonados recompensa la inversi贸n temprana, duplicando los precios conforme se acerca al objetivo de capitalizaci贸n.\n\nUna vez construido el edificio, los inquilinos que pagan durante los primeros 5 d铆as del mes reciben el 5% de su pago en tokens de recompensa, utilizables en cualquier comercio del ecosistema KodeChain. Esta interoperabilidad sectorial crea efectos de red exponenciales donde el valor se mantiene y multiplica dentro del ecosistema.\n\nLa integraci贸n con KodeChain permite que tokens generados por compras en panader铆as, veterinarias, eventos o productos cosm茅ticos puedan utilizarse como parte del pago de alquileres, creando una econom铆a circular autosostenible con m煤ltiples fuentes de ingresos.",
            "cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1757001444/Portafolio/banner_blockstate_light_m17gy3.png",
            "dark_cover": "https://res.cloudinary.com/dqluumk10/image/upload/v1757001444/Portafolio/banner_blockstate_dark_aiitur.png",
            "logo": "https://res.cloudinary.com/dqluumk10/image/upload/v1757000100/TripCode/Logos/logo_blockstate_bz2ixq.png",
            "uriDocs": "https://blockestate-docs.vercel.app/",
            "stack": [
                "React.js",
                "TypeScript",
                "Next.js",
                "Nest.js",
                "MongoDB",
                "Prisma",
                "Docker",
                "Google Cloud Platform",
                "Vercel",
                "KodeChain Blockchain",
                "Smart Contracts",
                "Tailwind CSS",
                "Web3.js"
            ],
            "repositories": [
                {
                    "id": "1",
                    "name": "BlockEstate SuperApp",
                    "description": "Aplicaci贸n web desarrollada en Next.js para la gesti贸n de inversiones inmobiliarias tokenizadas. Incluye dashboard para inversionistas, sistema de votaci贸n para administradores, calculadora de ROI con precios din谩micos, y portal de inquilinos con gesti贸n de tokens de recompensa. Integrada con Web3 para interacciones blockchain y optimizada para SSR/SSG.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "https://github.com/kodechain/blockestate-frontend",
                    "web": "https://blockestate-platform.vercel.app/"
                },
                {
                    "id": "2",
                    "name": "BlockEstate Core",
                    "description": "API REST desarrollada en NestJS con arquitectura DDD para la gesti贸n de proyectos inmobiliarios tokenizados. Implementa autenticaci贸n JWT, valuaci贸n automatizada de terrenos, algoritmos de precios din谩micos, gesti贸n de fondos de construcci贸n y mantenimiento, e integraci贸n con KodeChain para distribuci贸n de tokens y procesamiento de pagos de alquileres.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "https://github.com/kodechain/blockestate-backend",
                    "web": "https://blockestate-api.vercel.app/"
                },
                {
                    "id": "4",
                    "name": "BlockEstate Documentation",
                    "description": "Documentaci贸n t茅cnica y comercial construida con Docusaurus. Incluye whitepaper del ecosistema KodeChain, gu铆as de inversi贸n, documentaci贸n de APIs, ejemplos de integraci贸n para desarrolladores, y manuales para propietarios de terrenos, inversionistas e inquilinos. Disponible en espa帽ol e ingl茅s para expansi贸n latinoamericana.",
                    "status": "En desarrollo",
                    "isPrivate": true,
                    "uri": "https://github.com/kodechain/blockestate-docs",
                    "web": "https://blockestate-docs.vercel.app/"
                }
            ]
        }
    ],
    "Experience": [
        {
            "position": "Lead Full Stack Developer",
            "company": "Cr茅dito Ya",
            "logo": "/logos/credito_ya.png",
            "type": "Freelancer",
            "initialDate": "May 2024",
            "endDate": "Nov 2024",
            "Description": "Lider茅 el desarrollo de una aplicaci贸n web que digitaliza por completo el proceso de solicitud de pr茅stamos, optimizando la experiencia del usuario y reduciendo fricciones. Implement茅 interfaces din谩micas en tiempo real para clientes y empleados, mejorando la transparencia y la eficiencia en la gesti贸n de cada solicitud. Tambi茅n dise帽茅 flujos de trabajo automatizados para la aprobaci贸n de cr茅ditos, reduciendo tiempos de respuesta y optimizando la administraci贸n de solicitudes."
        },
        {
            "position": "Backend Developer",
            "company": "Smart Talent",
            "logo": "https://res.cloudinary.com/dqluumk10/image/upload/v1732945154/TripCode/Logos/cggalummkorqburvelfo.png",
            "type": "Freelancer",
            "initialDate": "May 2024",
            "endDate": "Jul 2024",
            "Description": "Desarroll茅 un sistema de gesti贸n de feedback para que los administradores pudieran visualizar, gestionar y dar seguimiento a los reportes internos de la empresa. Implement茅 un flujo de estados para clasificar y resolver los feedbacks de manera eficiente, permitiendo un control m谩s preciso sobre las solicitudes y mejorando la comunicaci贸n interna."
        },
        {
            "position": "Lead Full Stack Developer",
            "company": "Todo En Bicicleta",
            "logo": "/logos/todo_en_bici.png",
            "type": "Freelancer",
            "initialDate": "Dec 2023",
            "endDate": "Oct 2024",
            "Description": "Desarroll茅 una aplicaci贸n de viajes con seguimiento de ubicaci贸n en tiempo real, permitiendo a los usuarios monitorear el recorrido del viajero en directo. Implement茅 una zona de streaming interactivo para que los usuarios puedan conectarse en vivo, gestionar interacciones y recibir comentarios en tiempo real. Adem谩s, dise帽茅 un perfil completo del viajero, incluyendo biograf铆a y una secci贸n exclusiva para la visualizaci贸n de ebooks. El acceso a los libros est谩 protegido y solo disponible para quienes los hayan adquirido mediante PayPal, garantizando seguridad y exclusividad."
        }
    ],
    "Articles": [
        {
            "id": "01",
            "title": "TripCodeChain y la Web3: Una Mirada Simple a la Nueva Era Digital",
            "slug": "tripcodechain-web3-nueva-era-digital",
            "date": "27 de Marzo de 2025",
            "cover": "/covers/article_tripchain_web3.jpg",
            "description": "Descubre c贸mo TripCodeChain democratiza la tecnolog铆a blockchain, facilitando la creaci贸n de aplicaciones descentralizadas y ofreciendo m谩s control y seguridad en la era digital de la Web3.",
            "type": "web3",
            "content": "# TripCodeChain: Democratizando la Tecnolog铆a Blockchain para Negocios\n\n## Una Nueva Revoluci贸n Tecnol贸gica\n\nImagina un mundo donde cada peque帽o negocio pueda crear su propia moneda digital, automatizar sus procesos cr铆ticos y operar con la misma seguridad y transparencia que las grandes corporaciones tecnol贸gicas. Este es el sue帽o que TripChain est谩 haciendo realidad.\n\n## 驴Qu茅 Hace nico a TripCodeChain?\n\nTripChain no es solo otra plataforma blockchain. Es un ecosistema completo dise帽ado para democratizar la tecnolog铆a descentralizada, permitiendo que cualquier empresa, desde una peque帽a tienda local hasta una corporaci贸n internacional, aproveche el poder de los smart contracts y las criptomonedas.\n\n## Tecnolog铆a Revolucionaria: C贸mo Funciona\n\n### 1. Blockchain Descentralizada de Pr贸xima Generaci贸n\n\nLa red de TripChain utiliza un innovador mecanismo de consenso h铆brido que combina:\n\n- **Delegated Proof of Stake (DPoS)**: Para validaciones r谩pidas y eficientes\n- **Practical Byzantine Fault Tolerance (PBFT)**: Garantizando una seguridad inquebrantable\n\n### 2. Smart Contracts Inteligentes\n\nTripChain introduce un modelo 煤nico con dos tipos de smart contracts:\n\n#### Contrato de Transacciones y Recompensas\n\n- Registra pagos en tiempo real\n- Emite autom谩ticamente criptomonedas como recompensa a clientes\n- Valida cada transacci贸n con precisi贸n milim茅trica\n\n#### Contrato de Procesos Cr铆ticos\n\n- Almacena informaci贸n empresarial sensible\n- Garantiza la inmutabilidad de registros importantes\n- Permite auditor铆as transparentes sin exponer datos confidenciales\n\n### 3. Criptomonedas Personalizadas\n\nCada negocio puede:\n\n- Crear su propia criptomoneda\n- Establecer reglas de emisi贸n\n- Definir mecanismos de recompensa\n- Controlar la oferta y demanda de su token\n\n## Beneficios Revolucionarios\n\n### Para Negocios\n\n- Seguridad de nivel empresarial\n- Automatizaci贸n de procesos\n- Transparencia total\n- Nuevas formas de generar valor\n\n### Para Clientes\n\n- Recompensas instant谩neas\n- Trazabilidad de transacciones\n- Experiencias de compra mejoradas\n\n## Casos de Uso Reales\n\n### BlockScrum: Gesti贸n de Proyectos Blockchain\n\nUna plataforma que registra cada sprint, tarea y asignaci贸n en una blockchain inmutable, eliminando disputas y mejorando la transparencia en equipos de desarrollo.\n\n### ParfumCol: Comercio Electr贸nico Descentralizado\n\nUn marketplace de perfumes donde cada compra genera tokens de recompensa, creando un ecosistema de fidelizaci贸n basado en blockchain.\n\n### Inventario Descentralizado\n\nUna soluci贸n que permite a negocios de cualquier tama帽o gestionar su inventario, emitir criptomonedas y automatizar procesos cr铆ticos.\n\n## El Futuro ya Est谩 Aqu铆\n\nTripChain no es solo una tecnolog铆a. Es una revoluci贸n econ贸mica que democratiza el acceso a herramientas financieras avanzadas, permitiendo que incluso el negocio m谩s peque帽o pueda operar con la eficiencia de una corporaci贸n global.\n\n**La econom铆a digital del futuro no ser谩 centralizada. Ser谩 descentralizada, transparente y accesible para todos.**\n\n Bienvenidos a la Era TripCodeChain.",
            "proyects": [
                {
                    "id": "1",
                    "name": "BlockScrum",
                    "slug": "SaaS enfocado en el seguimiento de proyectos Scrum",
                    "description": "Plataforma de gesti贸n 谩gil de proyectos basada en Scrum, que permite la planificaci贸n, monitoreo y optimizaci贸n de tareas en equipos de desarrollo. Incorpora tecnolog铆a blockchain para registrar eventos cr铆ticos del proyecto de manera inmutable, asegurando transparencia y trazabilidad en cada sprint, tarea y asignaci贸n de equipo.",
                    "largeDescription": "Aplicaci贸n dise帽ada para la gesti贸n de proyectos bajo la metodolog铆a Scrum, proporcionando tableros interactivos para la planificaci贸n y seguimiento de sprints en tiempo real. Adem谩s de sus herramientas tradicionales de organizaci贸n de tareas y roles, BlockScrum utiliza la blockchain de TripChain para registrar eventos clave dentro del proyecto, como asignaciones de tareas, cambios en sprints y entregas finales. Esto permite que los equipos cuenten con un historial inmutable de su progreso, garantizando la transparencia y facilitando auditor铆as de cumplimiento.\n\nGracias a su arquitectura modular y escalable, BlockScrum permite la automatizaci贸n de flujos de trabajo mediante integraci贸n con APIs externas, gesti贸n de permisos basada en roles y an谩lisis de rendimiento de los equipos. Su integraci贸n con blockchain proporciona seguridad adicional en la validaci贸n de datos cr铆ticos del proyecto, asegurando que las decisiones tomadas en el desarrollo sean confiables y verificables.",
                    "cover": "/backgrounds-projects/scrum_mosaic.jpg",
                    "uriDocs": "",
                    "stack": [
                        "React.js",
                        "typescript",
                        "Nextjs",
                        "MongoDB",
                        "Prisma",
                        "Vercel",
                        "Blockchain",
                        "Tailwind CSS"
                    ],
                    "repositories": [
                        {
                            "id": "1",
                            "name": "Blockscrum-core",
                            "isPrivate": true,
                            "description": "BlockScrum es una plataforma integral para la gesti贸n 谩gil de proyectos basada en la metodolog铆a Scrum. Permite la planificaci贸n, seguimiento y control de tareas en equipos de desarrollo.",
                            "status": "En desarrollo",
                            "uri": "https://github.com/teamTripCode/tc-scrum-app",
                            "web": "https://blockscrum.vercel.app/"
                        },
                        {
                            "id": "2",
                            "name": "Documentaci贸n Web",
                            "isPrivate": true,
                            "description": "Repositorio destinado a la documentaci贸n oficial de BlockScrum, donde se detallan funcionalidades, gu铆as de uso y mejores pr谩cticas para optimizar la gesti贸n de proyectos 谩giles.",
                            "status": "Planeando",
                            "uri": "https://github.com/teamTripCode/tc-scrum-app",
                            "web": "https://blockscrum.vercel.app/"
                        }
                    ]
                },
                {
                    "id": "2",
                    "name": "TripCode Chain",
                    "slug": "Blockchain para la gesti贸n empresarial y transacciones seguras",
                    "description": "Blockchain descentralizada dise帽ada para que las empresas gestionen transacciones, emitan su propia criptomoneda y registren procesos cr铆ticos con seguridad e inmutabilidad. Utiliza una red P2P y smart contracts para automatizar pagos, controlar inventarios y validar operaciones sin intermediarios. Su algoritmo de consenso h铆brido combina Delegated Proof of Stake (DPoS) y Practical Byzantine Fault Tolerance (PBFT), garantizando transacciones r谩pidas, seguras y eficientes.",
                    "largeDescription": "Blockchain descentralizada enfocada en la gesti贸n empresarial, permitiendo a las compa帽铆as registrar transacciones, emitir criptomonedas propias y garantizar la integridad de sus procesos cr铆ticos. Su arquitectura basada en una red P2P (Peer-to-Peer) permite que m煤ltiples nodos almacenen y validen informaci贸n sin depender de un servidor central, asegurando alta disponibilidad y resistencia ante fallos.\nCada nodo en TripChain mantiene una copia completa de la blockchain y participa en la validaci贸n de transacciones a trav茅s de un mecanismo de consenso h铆brido que combina Delegated Proof of Stake (DPoS) y Practical Byzantine Fault Tolerance (PBFT). Esto permite procesar transacciones en segundos sin el alto consumo energ茅tico de otras blockchains tradicionales.\nLas empresas operan en TripChain mediante cuentas empresariales que interact煤an con smart contracts para gestionar pagos, emitir criptomonedas y registrar procesos clave como auditor铆as y control de inventario. Gracias a su estructura descentralizada, cada transacci贸n es transparente, auditable e inmutable, proporcionando confianza tanto a los negocios como a sus clientes.",
                    "cover": "/backgrounds-projects/blocks_mosaic.jpg",
                    "uriDocs": "https://tripchaindocs.fly.dev/es/",
                    "stack": [
                        "React.js",
                        "typescript",
                        "Nextjs",
                        "Nest.js",
                        "Docker",
                        "Kubernetes",
                        "Google Cloud Plattform",
                        "Vercel",
                        "Tailwind CSS"
                    ],
                    "repositories": [
                        {
                            "id": "1",
                            "name": "Nodo Semilla",
                            "description": "Facilita la conexi贸n inicial de nuevos nodos en la red blockchain. No valida transacciones ni almacena bloques completos, sino que mantiene una lista de nodos activos y la comparte para garantizar la descentralizaci贸n y continuidad de la red.",
                            "status": "Planeando",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-seed-node",
                            "web": "https://tripchain.vercel.app/"
                        },
                        {
                            "id": "2",
                            "name": "Nodo Validador",
                            "description": "Responsable de validar transacciones, generar bloques y mantener el consenso en la red. Implementa un mecanismo h铆brido de DPoS y PBFT para garantizar seguridad y velocidad en las transacciones, coordinando la verificaci贸n y comunicaci贸n entre nodos.",
                            "status": "Planeando",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-validator-node",
                            "web": "https://tripchain.vercel.app/"
                        },
                        {
                            "id": "3",
                            "name": "Nodo Completo",
                            "description": "Nodo que replica y almacena el historial completo de la blockchain, asegurando que todos los bloques y transacciones sean accesibles en cualquier momento. Act煤a como un respaldo descentralizado, permitiendo la validaci贸n independiente de datos y la ejecuci贸n de consultas avanzadas sin depender de terceros. Su implementaci贸n optimiza la indexaci贸n de datos y soporta sincronizaci贸n eficiente con otros nodos de la red.",
                            "status": "Planeando",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-full-node",
                            "web": "https://tripchain.vercel.app/"
                        },
                        {
                            "id": "4",
                            "name": "Nodo API",
                            "description": "M贸dulo de servicio que expone una API REST y WebSocket para interactuar con la blockchain. Facilita la consulta de datos en tiempo real, la gesti贸n de cuentas, la ejecuci贸n de smart contracts y el procesamiento de transacciones. Implementa mecanismos de autenticaci贸n y control de acceso, garantizando operaciones seguras y escalables para integraciones empresariales y clientes externos.",
                            "status": "Planeando",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-api-node",
                            "web": "https://tripchain.vercel.app/"
                        },
                        {
                            "id": "5",
                            "name": "TripChain Explorer",
                            "description": "Plataforma web para visualizar bloques, transacciones y la actividad de la red en tiempo real. Proporciona herramientas avanzadas de b煤squeda y an谩lisis, permitiendo auditar el historial de la blockchain, verificar el estado de cuentas y contratos inteligentes. Incluye gr谩ficos de m茅tricas de red, estados de validadores y estad铆sticas de uso, optimizando la transparencia y el monitoreo del sistema.",
                            "status": "Planeando",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-explorer",
                            "web": "https://tripchain.vercel.app/"
                        },
                        {
                            "id": "6",
                            "name": "Web Documentation",
                            "description": "Repositorio central de documentaci贸n t茅cnica de TripChain. Contiene gu铆as detalladas sobre la configuraci贸n de nodos, interacci贸n con la API, desarrollo de smart contracts y mejores pr谩cticas de seguridad. Incluye ejemplos pr谩cticos, especificaciones de endpoints y documentaci贸n en m煤ltiples formatos para facilitar la integraci贸n con sistemas externos.",
                            "status": "Funcionando",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-docs",
                            "web": "https://tripchain.vercel.app/docs"
                        }
                    ]
                },
                {
                    "id": "3",
                    "name": "ParfumCol",
                    "slug": "DApp para el comercio de perfumes y recompensas",
                    "description": "Plataforma de comercio electr贸nico especializada en perfumes, integrando tecnolog铆a blockchain para garantizar autenticidad, trazabilidad y seguridad en las transacciones. Implementa un sistema de recompensas basado en criptomonedas, permitiendo a los clientes obtener beneficios por sus compras.",
                    "largeDescription": "Aplicaci贸n de comercio electr贸nico enfocada en la venta de perfumes, utilizando la blockchain de TripChain para registrar transacciones de manera inmutable y proporcionar transparencia en los procesos de compra y distribuci贸n. Su integraci贸n con smart contracts permite la emisi贸n de criptomonedas como incentivos para los clientes, generando un ecosistema de recompensas dentro de la plataforma.\nLa arquitectura de ParfumCol est谩 compuesta por un backend en Nest.js que gestiona usuarios, pedidos y transacciones sobre la blockchain, y un frontend en Next.js optimizado para velocidad y experiencia de usuario. Utiliza Prisma como ORM para manejar datos en MongoDB, Docker para despliegue escalable y Google Cloud Platform para hosting y almacenamiento seguro.",
                    "cover": "/backgrounds-projects/blocks_mosaic.jpg",
                    "uriDocs": "https://parfumcol-docs.vercel.app/",
                    "stack": [
                        "React.js",
                        "typescript",
                        "Nextjs",
                        "Nest.js",
                        "MongoDB",
                        "Prisma",
                        "Docker",
                        "Google Cloud Plattform",
                        "Vercel",
                        "Blockchain",
                        "Tailwind CSS"
                    ],
                    "repositories": [
                        {
                            "id": "1",
                            "name": "Backend API",
                            "description": "Microservicio backend desarrollado en Nest.js con TypeScript, encargado de la autenticaci贸n de usuarios, gesti贸n de pedidos y procesamiento de pagos. Utiliza Prisma como ORM para la manipulaci贸n de datos en MongoDB e integra la blockchain de TripChain para registrar todos los procesos cr铆ticos de la aplicaci贸n. Implementa smart contracts personalizados que gestionan la criptomoneda nativa de la plataforma, permitiendo la emisi贸n y distribuci贸n de recompensas para los usuarios que realizan compras o pagan suscripciones. Expone una API RESTful segura con validaci贸n JWT, control de acceso basado en roles y protecci贸n contra ataques mediante rate limiting.",
                            "status": "Planeando",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/parfumcol-backend",
                            "web": "https://parfumcol.vercel.app/"
                        },
                        {
                            "id": "2",
                            "name": "Frontend Web",
                            "description": "Aplicaci贸n frontend desarrollada en Next.js con TypeScript y React, optimizada para rendimiento y SEO mediante Server-Side Rendering (SSR) y Static Site Generation (SSG). Proporciona una interfaz interactiva para la compra de perfumes y la gesti贸n de recompensas en criptomonedas. Se comunica con la API backend para procesar pagos y registrar transacciones en la blockchain de TripChain. Implementa autenticaci贸n con JWT, manejo de estado con Zustand o Redux y dise帽o modular basado en componentes reutilizables.",
                            "status": "Planeando",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/parfumcol-frontend",
                            "web": "https://parfumcol.vercel.app/"
                        }
                    ]
                },
                {
                    "id": "4",
                    "name": "Inventario Descentralizado",
                    "slug": "DApp para la gesti贸n de inventarios y recompensas empresariales",
                    "description": "Plataforma dise帽ada para la gesti贸n eficiente de inventarios en negocios de cualquier tama帽o. Permite administrar productos, registrar transacciones y automatizar recompensas en criptomonedas para los clientes seg煤n sus compras. Cada negocio (tenant) puede generar y gestionar su propia criptomoneda dentro del ecosistema, asegurando transparencia y trazabilidad en todas las operaciones.",
                    "largeDescription": "Aplicaci贸n SaaS basada en blockchain que permite a las empresas gestionar su inventario y recompensar a sus clientes con criptomonedas propias. Su arquitectura descentralizada basada en una red P2P garantiza la seguridad e inmutabilidad de los datos.\nCada negocio puede crear su propia criptomoneda dentro de la plataforma, establecer reglas de recompensa y realizar un seguimiento detallado de a qu茅 clientes se les ha otorgado criptomonedas por sus compras. Adem谩s, la integraci贸n con smart contracts asegura que cada transacci贸n sea transparente y auditable.\nLa plataforma proporciona herramientas avanzadas de gesti贸n de inventario, permitiendo a los negocios registrar entradas, salidas y movimientos de stock en tiempo real, con reportes detallados y automatizaci贸n de procesos clave. Gracias a su infraestructura escalable, puede adaptarse tanto a peque帽as tiendas como a grandes corporaciones con m煤ltiples sucursales.",
                    "cover": "/backgrounds-projects/blocks_mosaic.jpg",
                    "uriDocs": "dwdwd",
                    "stack": [
                        "React.js",
                        "typescript",
                        "Nextjs",
                        "Nest.js",
                        "MongoDB",
                        "Prisma",
                        "Docker",
                        "Google Cloud Plattform",
                        "Vercel",
                        "Blockchain",
                        "Tailwind CSS"
                    ],
                    "repositories": [
                        {
                            "id": "1",
                            "name": "Frontend App",
                            "description": "Aplicaci贸n web desarrollada en Next.js con React y TypeScript. Implementa un sistema de gesti贸n de inventarios en tiempo real con autenticaci贸n basada en JWT, interfaces din谩micas con Zustand para manejo de estado global y comunicaci贸n eficiente con la API backend mediante Axios. Optimizado para SSR y SSG, asegurando una carga r谩pida y una experiencia fluida.",
                            "status": "En desarrollo",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-inventory-frontend",
                            "web": "https://decentralized-inventory.vercel.app/"
                        },
                        {
                            "id": "2",
                            "name": "Backend App",
                            "description": "API REST desarrollada en NestJS con una arquitectura modular basada en principios de DDD (Domain-Driven Design). Implementa autenticaci贸n con JWT, gesti贸n de usuarios multi-tenant, integraci贸n con MongoDB a trav茅s de Prisma y un motor de smart contracts para la emisi贸n y gesti贸n de criptomonedas de cada negocio. Desplegado en Google Cloud con contenedores Docker.",
                            "status": "En desarrollo",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-inventory-backend",
                            "web": "https://decentralized-inventory-api.vercel.app/"
                        },
                        {
                            "id": "3",
                            "name": "Documentation Web",
                            "description": "Sitio web de documentaci贸n t茅cnica construido con Docusaurus y alojado en Vercel. Contiene gu铆as de integraci贸n para desarrolladores, documentaci贸n de la API REST y ejemplos de implementaci贸n de los smart contracts utilizados en la plataforma. Dise帽ado para facilitar la adopci贸n del sistema por parte de empresas y desarrolladores.",
                            "status": "En desarrollo",
                            "isPrivate": false,
                            "uri": "https://github.com/teamTripCode/tc-inventory-docs",
                            "web": "https://decentralized-inventory-docs.vercel.app/"
                        }
                    ]
                }
            ]
        },
        {
            "id": "02",
            "title": "TypeScript y Go: El Espejismo del Rendimiento en Desarrollo y Producci贸n",
            "slug": "typescript-go-rendimiento-desarrollo",
            "date": "27 de Marzo de 2025",
            "cover": "/covers/article_go_ts.png",
            "description": "La migraci贸n de TypeScript a Go mejora las herramientas de desarrollo, pero no garantiza un rendimiento m谩gico en producci贸n.",
            "type": "development",
            "content": "# TypeScript y Go: El Espejismo del Rendimiento en Desarrollo y Producci贸n\n\nCuando se anuncia una mejora de rendimiento de 10x, los desarrolladores inevitablemente se emocionan. La migraci贸n de TypeScript a una implementaci贸n nativa en Go genera expectativas de transformaciones radicales en el rendimiento de aplicaciones. Sin embargo, la realidad es m谩s compleja y matizada.\n\n## Desarrollo vs Producci贸n: Dos Mundos Diferentes\n\n### El Contexto de las Herramientas de Desarrollo\n\nLas mejoras anunciadas por el equipo de TypeScript se centran principalmente en el ecosistema de desarrollo:\n\n1. **Velocidad de Compilaci贸n**\n   Reducci贸n de tiempos de compilaci贸n hasta 10 veces, carga m谩s r谩pida de proyectos en editores e inicio instant谩neo de herramientas de desarrollo.\n\n2. **Experiencia del Desarrollador**\n   Autocompletado m谩s r谩pido, navegaci贸n entre c贸digo m谩s 谩gil, refactorizaci贸n instant谩nea y detecci贸n de errores m谩s eficiente.\n\n### Por Qu茅 Esto No Se Traduce Directamente a Rendimiento en Producci贸n\n\n#### Diferencias Fundamentales de Ejecuci贸n\n\n- **Compilaci贸n vs Ejecuci贸n**: Las herramientas de desarrollo se ejecutan en entornos de desarrollo local.\n- **Runtime**: La aplicaci贸n en producci贸n usa el motor de JavaScript/Node.js, no el compilador.\n- **Contexto de Ejecuci贸n**: Los optimizadores en producci贸n (como V8 de Chrome) operan de manera diferente.\n\n#### Capas de Abstracci贸n\n\n- TypeScript se compila a JavaScript\n- Go genera c贸digo binario nativo\n- En producci贸n, sigues ejecutando sobre m谩quinas virtuales como Node.js\n\n## Factores Reales de Rendimiento en Producci贸n\n\n1. **Arquitectura de Aplicaci贸n**\n   Dise帽o de microservicios, estrategias de cach茅 y optimizaci贸n de consultas de base de datos.\n\n2. **Infraestructura**\n   Balanceadores de carga, configuraci贸n de servidores y estrategias de escalamiento.\n\n3. **Algoritmos y Estructuras de Datos**\n   Eficiencia de implementaciones, complejidad computacional y manejo de memoria.\n\n## Mitos y Realidades\n\n**Mito**: \"Migrar a Go mejorar谩 mi aplicaci贸n\"  \n**Realidad**: Solo mejorar谩 herramientas de desarrollo\n\n**Mito**: \"10x m谩s r谩pido significa aplicaci贸n m谩s r谩pida\"  \n**Realidad**: Mejora principalmente en compilaci贸n y herramientas\n\n## Estrategias Reales de Optimizaci贸n\n\n### Para Desarrollo\n- Usar nueva implementaci贸n de TypeScript\n- Aprovechar herramientas m谩s r谩pidas\n- Mejorar experiencia de codificaci贸n\n\n### Para Producci贸n\n1. Optimizaci贸n de c贸digo\n2. Mejora de arquitectura\n3. Uso eficiente de recursos\n4. Implementaci贸n de patrones de dise帽o eficientes\n\n## Conclusi贸n: Expectativas Realistas\n\nLa migraci贸n de TypeScript a Go representa un avance significativo en herramientas de desarrollo, no una soluci贸n m谩gica para rendimiento en producci贸n.\n\n**Consejos Finales**:\n- Celebra las mejoras en desarrollo\n- No esperes milagros en producci贸n\n- Contin煤a enfoc谩ndote en optimizaci贸n de arquitectura\n- Realiza benchmarks reales\n- Mant茅n una mentalidad cr铆tica sobre promesas de rendimiento\n\n### La Verdadera Optimizaci贸n\n\nEl rendimiento no viene de un lenguaje o herramienta, sino de:\n- Dise帽o inteligente\n- Comprensi贸n profunda de la arquitectura\n- Implementaci贸n eficiente\n- Mejora continua\n\n**La tecnolog铆a evoluciona, pero los principios de buena ingenier铆a de software permanecen constantes.**",
            "proyects": []
        }
    ]
}